In [2]:
import pandas as pd
import numpy as np

In [3]:
x = np.array([3,4,5,6,7,8,12])

In [4]:
s = pd.Series(x)

In [5]:
print(s)

0     3
1     4
2     5
3     6
4     7
5     8
6    12
dtype: int32

In [8]:
# x = np.array([[3,4,5,6,7,8,12],[12,14,45,67,11,2,12]])
data = {'movies':['sanju','hulk','kgf','zero','thor','superman','batman'],
       'ratings':[4,4,5,3,4,4,5]}

In [10]:
s = pd.Series(data)

In [11]:
s

movies     [sanju, hulk, kgf, zero, thor, superman, batman]
ratings                               [4, 4, 5, 3, 4, 4, 5]
dtype: object

In [12]:
df = pd.DataFrame(data)

In [13]:
df

     movies  ratings
0     sanju        4
1      hulk        4
2       kgf        5
3      zero        3
4      thor        4
5  superman        4
6    batman        5

In [14]:
df.columns

Index(['movies', 'ratings'], dtype='object')

In [15]:
df['ratings'] == 5

0    False
1    False
2     True
3    False
4    False
5    False
6     True
Name: ratings, dtype: bool

In [16]:
df[df['ratings'] == 5]

   movies  ratings
2     kgf        5
6  batman        5

In [17]:
category = ['bollywood','hollywood','bollywood','bollywood','hollywood','hollywood','hollywood']

df['category'] = category

In [18]:
df

     movies  ratings   category
0     sanju        4  bollywood
1      hulk        4  hollywood
2       kgf        5  bollywood
3      zero        3  bollywood
4      thor        4  hollywood
5  superman        4  hollywood
6    batman        5  hollywood

In [21]:
df[(df['ratings'] == 5) & (df['category'] == 'hollywood')]

   movies  ratings   category
6  batman        5  hollywood

In [26]:
df.sort_values('ratings', ascending=False, inplace=True)

In [30]:
df.reset_index(inplace=True)

In [33]:
df.drop('index',axis=1)

     movies  ratings   category
0       kgf        5  bollywood
1    batman        5  hollywood
2     sanju        4  bollywood
3      hulk        4  hollywood
4      thor        4  hollywood
5  superman        4  hollywood
6      zero        3  bollywood